Tekla.Structures.Analysis.AnalysisPartEnd
The AnalysisPartEnd class contains information related to analysis part ends.

Tekla.Structures.Analysis.AnalysisPartEnd._Condition
The condition of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd._Connectivity
The connectivity of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd._Support
The support of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd._SupportCoordSystem
The coordinate system of the support.

Tekla.Structures.Analysis.AnalysisPartEnd._EccentricityMode
The eccentricity mode of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd._Eccentricity
The eccentricity of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd.Condition
The condition of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd.Connectivity
The connectivity of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd.Support
The support of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd.SupportCoordSystem
The coordinate system of the support.

Tekla.Structures.Analysis.AnalysisPartEnd.EccentricityMode
The eccentricity mode of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd.Eccentricity
The eccentricity of the part end (in the local coordinate system).